jamesmunns/kinetis-rs/platform/hal/lpuart/fsl_lpuart_hal.c
    if ((parityModeType) == kLpuartParityDisabled)
    {
        /* parity disabled, hence parity type is don't care */
        BW_LPUART_CTRL_PE(baseAddr, 0);
    }
    else
    {
        /* parity enabled */
        BW_LPUART_CTRL_PE(baseAddr, 1);
        /* parity odd/even depending on parity mode setting */
        BW_LPUART_CTRL_PT(baseAddr, (parityModeType) & 0x1);
    }

}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_SetTxRxInversionCmd
 * Description   : Configures the transmit and receive inversion control in the LPUART controller.
 * This function should only be called when the LPUART is between transmit and receive packets.
 *
 *END**************************************************************************/
void LPUART_HAL_SetTxRxInversionCmd(uint32_t baseAddr, uint32_t rxInvert, uint32_t txInvert)
{
    /* 0 - receive data not inverted, 1 - receive data inverted */
    BW_LPUART_STAT_RXINV(baseAddr, rxInvert);
    /* 0 - transmit data not inverted, 1 - transmit data inverted */
    BW_LPUART_CTRL_TXINV(baseAddr, txInvert);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_EnableTransmitter
 * Description   : Enables the LPUART transmitter.
 *
 *END**************************************************************************/
void LPUART_HAL_EnableTransmitter(uint32_t baseAddr)
{
    /* enable the transmitter based on the lpuart baseAddr */

    /* for this lpuart baseAddr, there is a two step process to clear the transmit complete */
    /* status flag: */
    /* 1. Read the status register with the status bit set */
    /* 2. enable the transmitter (change TE from 0 to 1) */
    /* first read the status register */

    /* no need to store the read value, it's assumed the status bit is set */
    HW_LPUART_STAT_RD(baseAddr);
    /* second, enable the transmitter */
    BW_LPUART_CTRL_TE(baseAddr, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_SetIntMode
 * Description   : Configures the LPUART module interrupts to enable/disable various interrupt sources.
 *
 *END**************************************************************************/
void LPUART_HAL_SetIntMode(uint32_t baseAddr, lpuart_interrupt_t interrupt, bool enable)
{
    uint32_t reg = (uint32_t)(interrupt) >> LPUART_SHIFT;
    uint32_t temp = 1U << (uint32_t)interrupt;

    switch ( reg )
    {
        case LPUART_BAUD_REG_ID:
            enable ? HW_LPUART_BAUD_SET(baseAddr, temp) : HW_LPUART_BAUD_CLR(baseAddr, temp);
            break;
        case LPUART_STAT_REG_ID:
            enable ? HW_LPUART_STAT_SET(baseAddr, temp) : HW_LPUART_STAT_CLR(baseAddr, temp);
            break;
        case LPUART_CTRL_REG_ID:
            enable ? HW_LPUART_CTRL_SET(baseAddr, temp) : HW_LPUART_CTRL_CLR(baseAddr, temp);
            break;
        case LPUART_DATA_REG_ID:
            enable ? HW_LPUART_DATA_SET(baseAddr, temp) : HW_LPUART_DATA_CLR(baseAddr, temp);
            break;
        case LPUART_MATCH_REG_ID:
            enable ? HW_LPUART_MATCH_SET(baseAddr, temp) : HW_LPUART_MATCH_CLR(baseAddr, temp);
            break;
        case LPUART_MODIR_REG_ID:
            enable ? HW_LPUART_MODIR_SET(baseAddr, temp) : HW_LPUART_MODIR_CLR(baseAddr, temp);
            break;
        default :
            break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_GetIntMode
 * Description   : Returns whether the LPUART module interrupts is enabled/disabled.
 *
 *END**************************************************************************/
bool LPUART_HAL_GetIntMode(uint32_t baseAddr, lpuart_interrupt_t interrupt)
{
    uint32_t reg = (uint32_t)(interrupt) >> LPUART_SHIFT;
	  bool retVal = false;

    switch ( reg )
    {
        case LPUART_BAUD_REG_ID:
            retVal = HW_LPUART_BAUD_RD(baseAddr) >> (uint32_t)(interrupt) & 1U;
            break;
        case LPUART_STAT_REG_ID:
            retVal = HW_LPUART_STAT_RD(baseAddr) >> (uint32_t)(interrupt) & 1U;
            break;
        case LPUART_CTRL_REG_ID:
            retVal = HW_LPUART_CTRL_RD(baseAddr) >> (uint32_t)(interrupt) & 1U;
            break;
        case LPUART_DATA_REG_ID:
            retVal = HW_LPUART_DATA_RD(baseAddr) >> (uint32_t)(interrupt) & 1U;
            break;
        case LPUART_MATCH_REG_ID:
            retVal = HW_LPUART_MATCH_RD(baseAddr) >> (uint32_t)(interrupt) & 1U;
            break;
        case LPUART_MODIR_REG_ID:
            retVal = HW_LPUART_MODIR_RD(baseAddr) >> (uint32_t)(interrupt) & 1U;
            break;
        default :
            break;
    }

    return retVal;
}

#if FSL_FEATURE_LPUART_HAS_DMA_ENABLE 
/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_ConfigureDma
 * Description   : LPUART configures DMA requests for Transmitter and Receiver.
 *
 *END**************************************************************************/
void LPUART_HAL_ConfigureDma(uint32_t baseAddr, bool txDmaConfig, bool  rxDmaConfig)
{
    /* TDMAE configures the transmit data register empty flag, S1[TDRE], */
    /* to generate a DMA request. */
    BW_LPUART_BAUD_TDMAE(baseAddr, txDmaConfig) ;/* set TDMAE to enable, clear to disable */
    /* RDMAE configures the receive data register fell flag, S1[RDRF], */
    /* to generate a DMA request. */
    BW_LPUART_BAUD_RDMAE(baseAddr, rxDmaConfig); /* set RDMAE to enable, clear to disable  */
}
#endif

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_GetWaitModeOperationConfig
 * Description   : LPUART configures DMA requests for Transmitter and Receiver.
 *
 *END**************************************************************************/
lpuart_operation_config_t LPUART_HAL_GetWaitModeOperationConfig(uint32_t baseAddr)
{
    /* get configuration lpuart operation in wait mode */
    /* In CPU wait mode: 0 - lpuart clocks continue to run; 1 - lpuart clocks freeze  */
    if (BR_LPUART_CTRL_DOZEEN(baseAddr) == 0)
    {
         return kLpuartOperates;
    }
    else
    {
         return kLpuartStops;
    }

