jamesmunns/kinetis-rs/platform/hal/lpuart/fsl_lpuart_hal.c
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_SedLoopbackCmd
 * Description   : Configures the LPUART loopback operation (enable/disable loopback operation)
 * In some LPUART instances, the user should disable the transmitter/receiver
 * before calling this function.
 * Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 *END**************************************************************************/
void LPUART_HAL_SedLoopbackCmd(uint32_t baseAddr, bool enable)
{
    /* configure lpuart to enable/disable operation in loopback mode */

    /* configure LOOPS bit to enable(1)/disable(0) loopback mode, but also need to clear RSRC */
    BW_LPUART_CTRL_LOOPS(baseAddr, enable);

    /* clear RSRC for loopback mode, and if loopback disabled, */
    /* this bit has no meaning but clear anyway */
    /* to set it back to default value */
    BW_LPUART_CTRL_RSRC(baseAddr, 0);

}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_SetSingleWireCmd
 * Description   : Configures the LPUART single-wire operation (enable/disable single-wire mode)
 * In some LPUART instances, the user should disable the transmitter/receiver
 * before calling this function.
 * Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 *END**************************************************************************/
void LPUART_HAL_SetSingleWireCmd(uint32_t baseAddr, bool enable)
{
    /* configure lpuart to enable/disable operation in single mode */

    /* to enable single-wire mode, need both LOOPS and RSRC set, to disable, clear both */
    BW_LPUART_CTRL_LOOPS(baseAddr, enable);
    BW_LPUART_CTRL_RSRC(baseAddr, enable);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_PutReceiverInStandbyMode
 * Description   : Places the LPUART receiver in standby mode.
 * In some LPUART instances,
 * before placing LPUART in standby mode, first determine whether the receiver is set to
 * wake on idle or whether it is already in idle state.
 * NOTE that the RWU should only be set with C1[WAKE] = 0 (wakeup on  idle) if the channel is currently
 * not idle.
 * This can be determined by the S2[RAF] flag. If it is set to wake up an IDLE event and the channel is
 * already idle, it is possible that the LPUART will discard data since data must be received
 * (or a LIN break detect) after an IDLE is detected and before IDLE is allowed to reasserted.
 *
 *END**************************************************************************/
lpuart_status_t LPUART_HAL_PutReceiverInStandbyMode(uint32_t baseAddr)
{
    /* In some lpuart instances, there is a condition that must be met before placing */
    /* rx in standby mode. */
    /* Before placing lpuart in standby, need to first determine if receiver is set to */
    /* wake on idle and if receiver is already in idle state. Per ref manual: */
    /* NOTE: RWU should only be set with C1[WAKE] = 0 (wakeup on idle) if the channel is */
    /* currently not idle. */
    /* This can be determined by the STAT[RAF] flag. If set to wake up an IDLE event and */
    /* the channel is already idle, it is possible that the LPUART will discard data since data */
    /* must be received (or a LIN break detect) after an IDLE is detected before IDLE is */
    /* allowed to reasserted. */
    lpuart_wakeup_method_t rxWakeMethod;
    bool lpuart_current_rx_state;

    /* see if wake is set for idle or */
    rxWakeMethod = LPUART_HAL_GetReceiverWakeupMethod(baseAddr);
    lpuart_current_rx_state = LPUART_HAL_GetStatusFlag(baseAddr, kLpuartRxActive);

    /* if both rxWakeMethod is set for idle and current rx state is idle, don't put in standy */
    if ((rxWakeMethod == kLpuartIdleLineWake) && (lpuart_current_rx_state == 0))
    {
        return kStatus_LPUART_RxStandbyModeError;
    }
    else
    {
        /* set the RWU bit to place receiver into standby mode */
        BW_LPUART_CTRL_RWU(baseAddr, 1);
        return kStatus_LPUART_Success;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_GetReceiverWakeupMethod
 * Description   : Gets the LPUART receiver wakeup method (idle line or addr-mark) from standby mode.
 *
 *END**************************************************************************/
lpuart_wakeup_method_t LPUART_HAL_GetReceiverWakeupMethod(uint32_t baseAddr)
{
    /* get configuration of the WAKE bit for idle line wake or address mark wake */
    if(HW_LPUART_CTRL(baseAddr).B.WAKE == 1)
    {
        return kLpuartAddrMarkWake;
    }
    else
    {
        return kLpuartIdleLineWake;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_ConfigureIdleLineDetect
 * Description   : LPUART idle-line detect operation configuration (idle line bit-count start and wake
 * up affect on IDLE status bit).
 * In some LPUART instances, the user should disable the transmitter/receiver
 * before calling this function.
 * Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 *END**************************************************************************/
void LPUART_HAL_ConfigureIdleLineDetect(uint32_t baseAddr,
                                         const lpuart_idle_line_config_t *config)
{
    /* Configure the idle line detection configuration as follows: */
    /* configure the ILT to bit count after start bit or stop bit */
    /* configure RWUID to set or not set IDLE status bit upon detection of */
    /* an idle character when recevier in standby */
    BW_LPUART_CTRL_ILT(baseAddr, config->idleLineType);
    BW_LPUART_STAT_RWUID(baseAddr, config->rxWakeIdleDetect);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_SetMatchAddressOperation
 * Description   : LPUART configures match address mode control (Note: Feature available on
 *                 select LPUART instances)
 *
 *END**************************************************************************/
lpuart_status_t LPUART_HAL_SetMatchAddressOperation( uint32_t baseAddr,
                        bool matchAddrMode1, bool matchAddrMode2,
                        uint8_t matchAddrValue1, uint8_t matchAddrValue2, lpuart_match_config_t config)
{
    BW_LPUART_BAUD_MAEN1(baseAddr, matchAddrMode1); /* Match Address Mode Enable 1 */
    BW_LPUART_BAUD_MAEN2(baseAddr, matchAddrMode2); /* Match Address Mode Enable 2 */
    BW_LPUART_MATCH_MA1(baseAddr, matchAddrValue1); /* match address register 1 */
    BW_LPUART_MATCH_MA2(baseAddr, matchAddrValue2); /* match address register 2 */
    BW_LPUART_BAUD_MATCFG(baseAddr, config); /* Match Configuration */

