jamesmunns/kinetis-rs/platform/hal/lpuart/fsl_lpuart_hal.c
    return kStatus_LPUART_Success;
}

#if FSL_FEATURE_LPUART_HAS_IR_SUPPORT
/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_SetInfraredOperation
 * Description   : Configures the LPUART infrared operation.
 *
 *END**************************************************************************/
void LPUART_HAL_SetInfraredOperation(uint32_t baseAddr, bool enable,
                                           lpuart_ir_tx_pulsewidth_t pulseWidth)
{
    /* enable or disable infrared */
    BW_LPUART_MODIR_IREN(baseAddr, enable);

    /* configure the narrow pulse width of the IR pulse */
    BW_LPUART_MODIR_TNP(baseAddr, pulseWidth);
}
#endif  /* FSL_FEATURE_LPUART_HAS_IR_SUPPORT */

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_GetStatusFlag
 * Description   : LPUART get status flag by passing flag enum.
 *
 *END**************************************************************************/
bool LPUART_HAL_GetStatusFlag(uint32_t baseAddr, lpuart_status_flag_t statusFlag)
{
    uint32_t reg = (uint32_t)(statusFlag) >> LPUART_SHIFT;
	  bool retVal = false;

    switch ( reg )
    {
        case LPUART_BAUD_REG_ID:
            retVal = HW_LPUART_BAUD_RD(baseAddr) >> (uint32_t)(statusFlag) & 1U;
            break;
        case LPUART_STAT_REG_ID:
            retVal = HW_LPUART_STAT_RD(baseAddr) >> (uint32_t)(statusFlag) & 1U;
            break;
        case LPUART_CTRL_REG_ID:
            retVal = HW_LPUART_CTRL_RD(baseAddr) >> (uint32_t)(statusFlag) & 1U;
            break;
        case LPUART_DATA_REG_ID:
            retVal = HW_LPUART_DATA_RD(baseAddr) >> (uint32_t)(statusFlag) & 1U;
            break;
        case LPUART_MATCH_REG_ID:
            retVal = HW_LPUART_MATCH_RD(baseAddr) >> (uint32_t)(statusFlag) & 1U;
            break;
        case LPUART_MODIR_REG_ID:
            retVal = HW_LPUART_MODIR_RD(baseAddr) >> (uint32_t)(statusFlag) & 1U;
            break;
        default:
            break;
    }

    return retVal;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_ClearStatusFlag
 * Description   : LPUART clears an individual status flag 
 * (see lpuart_status_flag_t for list of status bits).
 *
 *END**************************************************************************/
lpuart_status_t LPUART_HAL_ClearStatusFlag(uint32_t baseAddr, lpuart_status_flag_t statusFlag)
{
    lpuart_status_t returnCode = kStatus_LPUART_Success;

    /* clear the desired, individual status flag as passed in through statusFlag  */
    switch(statusFlag)
    {
        case kLpuartTxDataRegEmpty:
            /* This flag is cleared automatically by other lpuart operations */
            /* and cannot be manually cleared, return error code */
            returnCode = kStatus_LPUART_ClearStatusFlagError;
            break;

        case kLpuartTxComplete:
            /* This flag is cleared automatically by other lpuart operations */
            /* and cannot be manually cleared, return error code */
            returnCode = kStatus_LPUART_ClearStatusFlagError;
            break;

        case kLpuartRxDataRegFull:
            /* This flag is cleared automatically by other lpuart operations and */
            /* cannot be manually cleared, return error code */
            returnCode = kStatus_LPUART_ClearStatusFlagError;
            break;

        case kLpuartIdleLineDetect:
            /* write one to clear status flag */
            BW_LPUART_STAT_IDLE(baseAddr, 1);
            break;

        case kLpuartRxOverrun:
            /* write one to clear status flag */
            BW_LPUART_STAT_OR(baseAddr, 1);
            break;

        case kLpuartNoiseDetect:
            /* write one to clear status flag */
            BW_LPUART_STAT_NF(baseAddr, 1);
            break;

        case kLpuartFrameErr:
            /* write one to clear status flag */
            BW_LPUART_STAT_FE(baseAddr, 1);
            break;

        case kLpuartParityErr:
            /* write one to clear status flag */
            BW_LPUART_STAT_PF(baseAddr, 1);
            break;

        case kLpuartLineBreakDetect:
            /* write one to clear status flag */
            BW_LPUART_STAT_LBKDIF(baseAddr, 1);
            break;

        case kLpuartRxActiveEdgeDetect:
            /* write one to clear status flag */
            BW_LPUART_STAT_RXEDGIF(baseAddr, (1U));
            break;

        case kLpuartRxActive:
            /* This flag is cleared automatically by other lpuart operations and */
            /* cannot be manually cleared, return error code */
            returnCode = kStatus_LPUART_ClearStatusFlagError;
            break;

#if FSL_FEATURE_LPUART_HAS_EXTENDED_DATA_REGISTER_FLAGS
        case kLpuartNoiseInCurrentWord:
            /* This flag is not clearable, it simply reflects the status in the */
            /* current data word and changes with each new data word */
            returnCode = kStatus_LPUART_ClearStatusFlagError;
            break;

        case kLpuartParityErrInCurrentWord:
            /* This flag is not clearable, it simply reflects the status in the */
            /* current data word and changes with each new data word */
            returnCode = kStatus_LPUART_ClearStatusFlagError;
            break;
#endif

#if FSL_FEATURE_LPUART_HAS_ADDRESS_MATCHING
        case kLpuartMatchAddrOne:
            /* write one to clear status flag */
            BW_LPUART_STAT_MA1F(baseAddr, 1);
            break;
        case kLpuartMatchAddrTwo:
            /* write one to clear status flag */
            BW_LPUART_STAT_MA2F(baseAddr, 1);
            break;
#endif

        default:  /* catch inputs that are not recognized */
            returnCode = kStatus_LPUART_ClearStatusFlagError;
            break;
    }

