jamesmunns/kinetis-rs/platform/hal/lpuart/fsl_lpuart_hal.c
    return (returnCode);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_ClearAllNonAutoclearStatusFlags
 * Description   : LPUART clears ALL status flags.
 *
 *END**************************************************************************/
void LPUART_HAL_ClearAllNonAutoclearStatusFlags(uint32_t baseAddr)
{
    /* clear the status flags that can be manually cleared */
    /* note, some flags are automatically cleared and cannot be cleared automatically */
    LPUART_HAL_ClearStatusFlag(baseAddr, kLpuartIdleLineDetect);
    LPUART_HAL_ClearStatusFlag(baseAddr, kLpuartRxOverrun);
    LPUART_HAL_ClearStatusFlag(baseAddr, kLpuartNoiseDetect);
    LPUART_HAL_ClearStatusFlag(baseAddr, kLpuartFrameErr);
    LPUART_HAL_ClearStatusFlag(baseAddr, kLpuartParityErr);
    LPUART_HAL_ClearStatusFlag(baseAddr, kLpuartLineBreakDetect);
    LPUART_HAL_ClearStatusFlag(baseAddr, kLpuartRxActiveEdgeDetect);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_Putchar9
 * Description   : Sends the LPUART 9-bit character.
 *
 *END**************************************************************************/
void LPUART_HAL_Putchar9(uint32_t baseAddr, uint16_t data)
{
    uint8_t ninthDataBit;

    ninthDataBit = (data >> 8U) & 0x1U;  /* isolate the ninth data bit */

    /* put 9-bit data to transmit */

    /* first, write to the ninth data bit (bit position T8, where T[0:7]=8-bits, T8=9th bit) */
    BW_LPUART_CTRL_R9T8(baseAddr, ninthDataBit);

    /* write to the data register last since this will trigger transmit complete status flag */
    /* also typecast to uint8_t to match register type */
    HW_LPUART_DATA_WR(baseAddr, (uint8_t)data);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_Putchar10
 * Description   : Sends the LPUART 10-bit character.
 *
 *END**************************************************************************/
lpuart_status_t LPUART_HAL_Putchar10(uint32_t baseAddr, uint16_t data)
{
    uint8_t ninthDataBit;
    uint8_t tenthDataBit;

    /* put 10-bit data to transmit */
    ninthDataBit = (data >> 8U) & 0x1U;  /* isolate the ninth data bit */
    tenthDataBit = (data >> 9U) & 0x1U;  /* isolate the tenth data bit */

    /* first, write to the tenth data bit (bit position T9, where T[0:7]=8-bits, */
    /* T9=10th bit, T8=9th bit) */
    BW_LPUART_CTRL_R8T9(baseAddr, tenthDataBit);

    /* next, write to the ninth data bit (bit position T8, where T[0:7]=8-bits, */
    /* T9=10th bit, T8=9th bit) */
    BW_LPUART_CTRL_R9T8(baseAddr, ninthDataBit);

    /* write to the data register last since this will trigger transmit complete status flag */
    /* also typecast to uint8_t to match register type */
    HW_LPUART_DATA_WR(baseAddr, (uint8_t)data);

    return kStatus_LPUART_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_Getchar
 * Description   : Gets the LPUART 8-bit character.
 *
 *END**************************************************************************/
void LPUART_HAL_Getchar(uint32_t baseAddr, uint8_t *readData)
{
    /* get 8-bit data from the lpuart data register */
    *readData = (uint8_t)HW_LPUART_DATA_RD(baseAddr);  /* read 8-bit data from data register */
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_Getchar9
 * Description   : Gets the LPUART 9-bit character.
 *
 *END**************************************************************************/
void  LPUART_HAL_Getchar9(uint32_t baseAddr, uint16_t *readData)
{
    uint16_t temp;

    /* get 9-bit data from the lpuart data register */
    /* read ninth data bit and left shift to bit position R8 before reading */
    /* the 8 other data bits R[7:0] */
    temp = HW_LPUART_CTRL(baseAddr).B.R8T9;  /* need this two step process to work around mishra rule */
    *readData = temp << 8;

    /* do last: get 8-bit data from the lpuart data register, will clear certain */
    /* receive status bits once completed */
    /* need to OR these 8-bits with the ninth bit value above */
    *readData |= (uint8_t)HW_LPUART_DATA_RD(baseAddr);  /* read 8-bit data from data register  */
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_Getchar10
 * Description   : Gets the LPUART 10-bit character.
 *
 *END**************************************************************************/
lpuart_status_t LPUART_HAL_Getchar10(uint32_t baseAddr, uint16_t *readData)
{
    /* get 10-bit data from the lpuart data register, available only on supported lpuarts */

    /* read tenth data bit and left shift to bit position R9 before reading the 9 other */
    /* data bits: R8 and R[7:0] */
    *readData = (uint16_t)((uint32_t)(HW_LPUART_CTRL(baseAddr).B.R9T8) << 9U);

    /* read ninth data bit and left shift to bit position R8 before reading the 8 other */
    /* data bits R[7:0] */
    *readData |= (uint16_t)((uint32_t)(HW_LPUART_CTRL(baseAddr).B.R8T9) << 8U);

    /* do last: get 8-bit data from the lpuart data register, will clear certain receive */
    /* status bits once completed */
    /* need to OR these 8-bits with the ninth bit value above */
    *readData |= HW_LPUART_DATA_RD(baseAddr);  /* read 8-bit data from data register */

    return kStatus_LPUART_Success;
}

/*******************************************************************************
 * EOF
 ******************************************************************************/

